IRP/src/Enums/SalesTransactionTypes/SalesTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>SalesTransactionTypes</name>
 <enumValues>
  <name>Sales</name>
 </enumValues>
 <enumValues>
  <name>ShipmentToTradeAgent</name>
 </enumValues>
 <enumValues>
  <name>RetailSales</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationCustomer</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationVendor</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/SalesTransactionTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();
	ChoiceData.Add(Enums.SalesTransactionTypes.Sales);
	ChoiceData.Add(Enums.SalesTransactionTypes.ShipmentToTradeAgent);
	
	If Parameters.Filter.Property("Ref") And 
		(TypeOf(Parameters.Filter.Ref) = Type("DocumentRef.SalesOrder") 
		Or TypeOf(Parameters.Filter.Ref) = Type("DocumentRef.SalesOrderClosing"))Then
		ChoiceData.Add(Enums.SalesTransactionTypes.RetailSales);
	EndIf;
EndProcedure
